; domain
(define (domain drone-dom)

    (:requirements
        :strips :typing
    )

    (:types
        drone human box content location carrier num
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry-box ?d - drone ?b - box)
        ;(drone-carry-carrier ?d - drone ?c - carrier)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
        (carrier-at ?c - carrier ?l - location)
        (carrier-has-box ?c ?b)
        (next ?n1 ?n2 - num)
        (carrier-n-boxes ?c - carrier ?n - num)
    )

    (:action move-carrier
        :parameters (?d - drone ?to ?from - location ?c - carrier)
        :precondition (and
            (drone-free ?d)
            (drone-at ?d ?from)
            (carrier-at ?c ?from)
        )
        :effect (and
            (not(carrier-at ?c ?from)); el carrier deja de estar en la localización
            (not(drone-at ?d ?from))
            (carrier-at ?c ?to)
            (drone-at ?d ?to)
        )
    )

    (:action move
       :parameters (?d - drone ?from ?to - location)
       :precondition (and 
           (drone-at ?d ?from)
       )
       :effect (and
           (drone-at ?d ?to) 
           (not (drone-at ?d ?from))
       )
    )

    (:action put-box-on-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;debe estar bajado el carrier
            (drone-carry-box ?d ?b) ;el dron tiene que tener la caja (haber hecho pick-up)
            (next ?n1 ?n2) ;no ha llegado al limite de capacidad
            (carrier-n-boxes ?c ?n1)
        )
        :effect (and
            (drone-free ?d)
            (not (drone-carry-box ?d ?b)) ;el dron deja de tener la caja
            (carrier-has-box ?c ?b) ;para tenerla el carrier
            (not (carrier-n-boxes ?c ?n1))
            (carrier-n-boxes ?c ?n2)
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry-box ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )

    (:action take-off-box-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;el carrier y el dron deben estar en el mismo sitio
            (carrier-has-box ?c ?b) ;la caja a coger la tiene que tener el carrier
            (drone-free ?d) ;el dron tiene que estar vacio
            (carrier-n-boxes ?c ?n2)
            (next ?n1 ?n2)
        )
        :effect (and
            (not(drone-free ?d))
            (drone-carry-box ?d ?b) ;el dron coge la caja, y
            (not(carrier-has-box ?c ?b)) ;el carrier ya no la tendrá
            (carrier-n-boxes ?c ?n1)
            (not(carrier-n-boxes ?c ?n2))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry-box ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry-box ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r1_l20_p20_c20_g20_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	box6 - box
	box7 - box
	box8 - box
	box9 - box
	box10 - box
	box11 - box
	box12 - box
	box13 - box
	box14 - box
	box15 - box
	box16 - box
	box17 - box
	box18 - box
	box19 - box
	box20 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	human6 - human
	human7 - human
	human8 - human
	human9 - human
	human10 - human
	human11 - human
	human12 - human
	human13 - human
	human14 - human
	human15 - human
	human16 - human
	human17 - human
	human18 - human
	human19 - human
	human20 - human
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(carrier-at carrier1 warehouse)
	(carrier-n-boxes carrier1 n0)
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-at box6 warehouse)
	(box-free box6)
	(box-at box7 warehouse)
	(box-free box7)
	(box-at box8 warehouse)
	(box-free box8)
	(box-at box9 warehouse)
	(box-free box9)
	(box-at box10 warehouse)
	(box-free box10)
	(box-at box11 warehouse)
	(box-free box11)
	(box-at box12 warehouse)
	(box-free box12)
	(box-at box13 warehouse)
	(box-free box13)
	(box-at box14 warehouse)
	(box-free box14)
	(box-at box15 warehouse)
	(box-free box15)
	(box-at box16 warehouse)
	(box-free box16)
	(box-at box17 warehouse)
	(box-free box17)
	(box-at box18 warehouse)
	(box-free box18)
	(box-at box19 warehouse)
	(box-free box19)
	(box-at box20 warehouse)
	(box-free box20)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 meds)
	(box-has box6 meds)
	(box-has box7 meds)
	(box-has box8 meds)
	(box-has box9 meds)
	(box-has box10 meds)
	(box-has box11 meds)
	(box-has box12 meds)
	(box-has box13 meds)
	(box-has box14 meds)
	(box-has box15 meds)
	(box-has box16 meds)
	(box-has box17 meds)
	(box-has box18 meds)
	(box-has box19 meds)
	(box-has box20 meds)
	(human-at human1 loc20)
	(human-at human2 loc20)
	(human-at human3 loc12)
	(human-at human4 loc3)
	(human-at human5 loc6)
	(human-at human6 loc17)
	(human-at human7 loc3)
	(human-at human8 loc12)
	(human-at human9 loc6)
	(human-at human10 loc19)
	(human-at human11 loc19)
	(human-at human12 loc20)
	(human-at human13 loc9)
	(human-at human14 loc6)
	(human-at human15 loc14)
	(human-at human16 loc5)
	(human-at human17 loc15)
	(human-at human18 loc5)
	(human-at human19 loc7)
	(human-at human20 loc8)
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
)

(:goal (and
	(drone-at drone1 warehouse)
	(carrier-at carrier1 warehouse)
	(human-has human1 meds)
	(human-has human2 meds)
	(human-has human4 meds)
	(human-has human5 food)
	(human-has human5 meds)
	(human-has human7 food)
	(human-has human7 meds)
	(human-has human8 meds)
	(human-has human9 meds)
	(human-has human10 meds)
	(human-has human11 meds)
	(human-has human12 meds)
	(human-has human13 food)
	(human-has human13 meds)
	(human-has human14 meds)
	(human-has human15 meds)
	(human-has human16 food)
	(human-has human16 meds)
	(human-has human18 meds)
	(human-has human19 meds)
	))
)

; plan
1. (pick-up drone1 box20 meds warehouse)
   deleted: (drone-free drone1) (box-at box20 warehouse)
   added: (drone-carry-box drone1 box20)
   goals met: 2 of 22
2. (move drone1 warehouse loc19)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc19)
   goals met: 1 of 22
3. (drop drone1 box20 meds loc19 human10)
   deleted: (drone-carry-box drone1 box20) (box-free box20)
   added: (drone-free drone1) (box-at box20 loc19) (human-has human10 meds)
   goals met: 2 of 22
4. (move drone1 loc19 warehouse)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 22
5. (pick-up drone1 box17 meds warehouse)
   deleted: (drone-free drone1) (box-at box17 warehouse)
   added: (drone-carry-box drone1 box17)
   goals met: 3 of 22
6. (move drone1 warehouse loc19)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc19)
   goals met: 2 of 22
7. (drop drone1 box17 meds loc19 human11)
   deleted: (drone-carry-box drone1 box17) (box-free box17)
   added: (drone-free drone1) (box-at box17 loc19) (human-has human11 meds)
   goals met: 3 of 22
8. (move drone1 loc19 warehouse)
   deleted: (drone-at drone1 loc19)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 22
9. (pick-up drone1 box13 meds warehouse)
   deleted: (drone-free drone1) (box-at box13 warehouse)
   added: (drone-carry-box drone1 box13)
   goals met: 4 of 22
10. (move drone1 warehouse loc7)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc7)
   goals met: 3 of 22
11. (drop drone1 box13 meds loc7 human19)
   deleted: (drone-carry-box drone1 box13) (box-free box13)
   added: (drone-free drone1) (box-at box13 loc7) (human-has human19 meds)
   goals met: 4 of 22
12. (move drone1 loc7 warehouse)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 22
13. (pick-up drone1 box14 meds warehouse)
   deleted: (drone-free drone1) (box-at box14 warehouse)
   added: (drone-carry-box drone1 box14)
   goals met: 5 of 22
14. (move drone1 warehouse loc6)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 4 of 22
15. (drop drone1 box14 meds loc6 human5)
   deleted: (drone-carry-box drone1 box14) (box-free box14)
   added: (drone-free drone1) (box-at box14 loc6) (human-has human5 meds)
   goals met: 5 of 22
16. (move drone1 loc6 loc7)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 loc7)
   goals met: 5 of 22
17. (move drone1 loc7 warehouse)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 22
18. (pick-up drone1 box19 meds warehouse)
   deleted: (drone-free drone1) (box-at box19 warehouse)
   added: (drone-carry-box drone1 box19)
   goals met: 6 of 22
19. (move drone1 warehouse loc6)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc6)
   goals met: 5 of 22
20. (drop drone1 box19 meds loc6 human9)
   deleted: (drone-carry-box drone1 box19) (box-free box19)
   added: (drone-free drone1) (box-at box19 loc6) (human-has human9 meds)
   goals met: 6 of 22
21. (move drone1 loc6 warehouse)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 22
22. (pick-up drone1 box11 meds warehouse)
   deleted: (drone-free drone1) (box-at box11 warehouse)
   added: (drone-carry-box drone1 box11)
   goals met: 7 of 22
23. (move drone1 warehouse loc18)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc18)
   goals met: 6 of 22
24. (move drone1 loc18 loc6)
   deleted: (drone-at drone1 loc18)
   added: (drone-at drone1 loc6)
   goals met: 6 of 22
25. (drop drone1 box11 meds loc6 human14)
   deleted: (drone-carry-box drone1 box11) (box-free box11)
   added: (drone-free drone1) (box-at box11 loc6) (human-has human14 meds)
   goals met: 7 of 22
26. (move drone1 loc6 warehouse)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 8 of 22
27. (pick-up drone1 box15 meds warehouse)
   deleted: (drone-free drone1) (box-at box15 warehouse)
   added: (drone-carry-box drone1 box15)
   goals met: 8 of 22
28. (move drone1 warehouse loc14)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 7 of 22
29. (drop drone1 box15 meds loc14 human15)
   deleted: (drone-carry-box drone1 box15) (box-free box15)
   added: (drone-free drone1) (box-at box15 loc14) (human-has human15 meds)
   goals met: 8 of 22
30. (move drone1 loc14 warehouse)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 warehouse)
   goals met: 9 of 22
31. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry-box drone1 box2)
   goals met: 9 of 22
32. (move drone1 warehouse loc14)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc14)
   goals met: 8 of 22
33. (move drone1 loc14 loc6)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 loc6)
   goals met: 8 of 22
34. (drop drone1 box2 food loc6 human5)
   deleted: (drone-carry-box drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc6) (human-has human5 food)
   goals met: 9 of 22
35. (move drone1 loc6 warehouse)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 warehouse)
   goals met: 10 of 22
36. (pick-up drone1 box10 meds warehouse)
   deleted: (drone-free drone1) (box-at box10 warehouse)
   added: (drone-carry-box drone1 box10)
   goals met: 10 of 22
37. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 9 of 22
38. (drop drone1 box10 meds loc3 human4)
   deleted: (drone-carry-box drone1 box10) (box-free box10)
   added: (drone-free drone1) (box-at box10 loc3) (human-has human4 meds)
   goals met: 10 of 22
39. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 11 of 22
40. (pick-up drone1 box5 meds warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry-box drone1 box5)
   goals met: 11 of 22
41. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 10 of 22
42. (drop drone1 box5 meds loc3 human7)
   deleted: (drone-carry-box drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc3) (human-has human7 meds)
   goals met: 11 of 22
43. (move drone1 loc3 warehouse)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 warehouse)
   goals met: 12 of 22
44. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry-box drone1 box1)
   goals met: 12 of 22
45. (move drone1 warehouse loc3)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc3)
   goals met: 11 of 22
46. (drop drone1 box1 food loc3 human7)
   deleted: (drone-carry-box drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc3) (human-has human7 food)
   goals met: 12 of 22
47. (move drone1 loc3 loc10)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 loc10)
   goals met: 12 of 22
48. (move drone1 loc10 warehouse)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 warehouse)
   goals met: 13 of 22
49. (pick-up drone1 box7 meds warehouse)
   deleted: (drone-free drone1) (box-at box7 warehouse)
   added: (drone-carry-box drone1 box7)
   goals met: 13 of 22
50. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 12 of 22
51. (drop drone1 box7 meds loc5 human18)
   deleted: (drone-carry-box drone1 box7) (box-free box7)
   added: (drone-free drone1) (box-at box7 loc5) (human-has human18 meds)
   goals met: 13 of 22
52. (move drone1 loc5 warehouse)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 14 of 22
53. (pick-up drone1 box12 meds warehouse)
   deleted: (drone-free drone1) (box-at box12 warehouse)
   added: (drone-carry-box drone1 box12)
   goals met: 14 of 22
54. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 13 of 22
55. (drop drone1 box12 meds loc5 human16)
   deleted: (drone-carry-box drone1 box12) (box-free box12)
   added: (drone-free drone1) (box-at box12 loc5) (human-has human16 meds)
   goals met: 14 of 22
56. (move drone1 loc5 warehouse)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 15 of 22
57. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry-box drone1 box3)
   goals met: 15 of 22
58. (move drone1 warehouse loc5)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc5)
   goals met: 14 of 22
59. (drop drone1 box3 food loc5 human16)
   deleted: (drone-carry-box drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc5) (human-has human16 food)
   goals met: 15 of 22
60. (move drone1 loc5 warehouse)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 warehouse)
   goals met: 16 of 22
61. (pick-up drone1 box8 meds warehouse)
   deleted: (drone-free drone1) (box-at box8 warehouse)
   added: (drone-carry-box drone1 box8)
   goals met: 16 of 22
62. (move drone1 warehouse loc20)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc20)
   goals met: 15 of 22
63. (drop drone1 box8 meds loc20 human12)
   deleted: (drone-carry-box drone1 box8) (box-free box8)
   added: (drone-free drone1) (box-at box8 loc20) (human-has human12 meds)
   goals met: 16 of 22
64. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 17 of 22
65. (pick-up drone1 box16 meds warehouse)
   deleted: (drone-free drone1) (box-at box16 warehouse)
   added: (drone-carry-box drone1 box16)
   goals met: 17 of 22
66. (move drone1 warehouse loc20)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc20)
   goals met: 16 of 22
67. (drop drone1 box16 meds loc20 human2)
   deleted: (drone-carry-box drone1 box16) (box-free box16)
   added: (drone-free drone1) (box-at box16 loc20) (human-has human2 meds)
   goals met: 17 of 22
68. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 18 of 22
69. (pick-up drone1 box6 meds warehouse)
   deleted: (drone-free drone1) (box-at box6 warehouse)
   added: (drone-carry-box drone1 box6)
   goals met: 18 of 22
70. (move drone1 warehouse loc20)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc20)
   goals met: 17 of 22
71. (drop drone1 box6 meds loc20 human1)
   deleted: (drone-carry-box drone1 box6) (box-free box6)
   added: (drone-free drone1) (box-at box6 loc20) (human-has human1 meds)
   goals met: 18 of 22
72. (move drone1 loc20 warehouse)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 warehouse)
   goals met: 19 of 22
73. (pick-up drone1 box9 meds warehouse)
   deleted: (drone-free drone1) (box-at box9 warehouse)
   added: (drone-carry-box drone1 box9)
   goals met: 19 of 22
74. (move drone1 warehouse loc12)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc12)
   goals met: 18 of 22
75. (drop drone1 box9 meds loc12 human8)
   deleted: (drone-carry-box drone1 box9) (box-free box9)
   added: (drone-free drone1) (box-at box9 loc12) (human-has human8 meds)
   goals met: 19 of 22
76. (move drone1 loc12 loc10)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 loc10)
   goals met: 19 of 22
77. (move drone1 loc10 warehouse)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 warehouse)
   goals met: 20 of 22
78. (pick-up drone1 box18 meds warehouse)
   deleted: (drone-free drone1) (box-at box18 warehouse)
   added: (drone-carry-box drone1 box18)
   goals met: 20 of 22
79. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 19 of 22
80. (drop drone1 box18 meds loc9 human13)
   deleted: (drone-carry-box drone1 box18) (box-free box18)
   added: (drone-free drone1) (box-at box18 loc9) (human-has human13 meds)
   goals met: 20 of 22
81. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 21 of 22
82. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry-box drone1 box4)
   goals met: 21 of 22
83. (move drone1 warehouse loc9)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc9)
   goals met: 20 of 22
84. (drop drone1 box4 food loc9 human13)
   deleted: (drone-carry-box drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc9) (human-has human13 food)
   goals met: 21 of 22
85. (move drone1 loc9 warehouse)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 warehouse)
   goals met: 22 of 22
